
# 1.Introduction
This assignment will help you to consolidate the concepts learnt in the session.

# 2.Problem Statement
It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).
2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.
3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)
4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.
5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',  # ASSIGNMENT
                               'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
                               '12. Air France', '"Swiss Air"']})
print(df.dtypes)
df

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [3]:
df["FlightNumber"] = df["FlightNumber"] + 10  # increase by 10
df["FlightNumber"] = df["FlightNumber"].replace(np.nan, 10)  # replacing nan with 10
df["FlightNumber"] = df["FlightNumber"].astype(int)  # to integer
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10055      [23, 47]               KLM(!)
1      MAdrid_miLAN            10            []    <Air France> (12)
2  londON_StockhOlm         10075  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis            10          [13]       12. Air France
4   Brussels_londOn         10095      [67, 32]          "Swiss Air"

In [4]:
df[["From", "To"]] = df.From_To.str.split("_", expand=True)  # splitting From_To
df = df[["From", "To", "FlightNumber", "RecentDelays", "Airline"]]
df

       From         To  FlightNumber  RecentDelays              Airline
0    LoNDon      paris         10055      [23, 47]               KLM(!)
1    MAdrid      miLAN            10            []    <Air France> (12)
2    londON  StockhOlm         10075  [24, 43, 87]  (British Airways. )
3  Budapest      PaRis            10          [13]       12. Air France
4  Brussels     londOn         10095      [67, 32]          "Swiss Air"

In [5]:
df["From"] = df.From.str.lower()
df["To"] = df.To.str.lower()
df["From"] = df.From.str.capitalize()
df["To"] = df.To.str.capitalize()
df

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10055      [23, 47]               KLM(!)
1    Madrid      Milan            10            []    <Air France> (12)
2    London  Stockholm         10075  [24, 43, 87]  (British Airways. )
3  Budapest      Paris            10          [13]       12. Air France
4  Brussels     London         10095      [67, 32]          "Swiss Air"

In [6]:
for row in df["RecentDelays"]:
    while len(row) < 3:
        row.append(np.NaN)
df

       From         To  FlightNumber     RecentDelays              Airline
0    London      Paris         10055    [23, 47, nan]               KLM(!)
1    Madrid      Milan            10  [nan, nan, nan]    <Air France> (12)
2    London  Stockholm         10075     [24, 43, 87]  (British Airways. )
3  Budapest      Paris            10   [13, nan, nan]       12. Air France
4  Brussels     London         10095    [67, 32, nan]          "Swiss Air"

In [7]:
df[["delay_1", "delay_2", "delay_3"]] = pd.DataFrame(df.RecentDelays.tolist())  # making separate columns for Delays
df = df.rename(columns={"RecentDelays": "Delays"})  # renaming RecentDelays
df = df[["From", "To", "FlightNumber", "Delays", "delay_1", "delay_2", "delay_3", "Airline"]]
df

       From         To  FlightNumber  ... delay_2  delay_3              Airline
0    London      Paris         10055  ...    47.0      NaN               KLM(!)
1    Madrid      Milan            10  ...     NaN      NaN    <Air France> (12)
2    London  Stockholm         10075  ...    43.0     87.0  (British Airways. )
3  Budapest      Paris            10  ...     NaN      NaN       12. Air France
4  Brussels     London         10095  ...    32.0      NaN          "Swiss Air"

[5 rows x 8 columns]